sivantoledo/vildehaye-firmware/vildehaye-common/cc13x0_peripherals_setup_1_50.c
/*
 * Sivan: This is for CC13X0 SDK version 1.50
 */

/*
 * Copyright (c) 2015-2016, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ====================== CC1310_LAUNCHXL.c ===================================
 *  This file is responsible for setting up the board specific items for the
 *  CC1310 LaunchPad.
 */


/*
 *  ====================== Includes ============================================
 */
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include <ti/devices/cc13x0/driverlib/ioc.h>
#include <ti/devices/cc13x0/driverlib/udma.h>
#include <ti/devices/cc13x0/inc/hw_ints.h>
#include <ti/devices/cc13x0/inc/hw_memmap.h>
#include <ti/sysbios/family/arm/m3/Hwi.h>
#include <ti/drivers/PIN.h>
#include <ti/drivers/pin/PINCC26XX.h>
#include <ti/drivers/PWM.h>
#include <ti/drivers/pwm/PWMTimerCC26XX.h>
#include <ti/drivers/timer/GPTimerCC26XX.h>
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC26XX.h>

#include "config.h"

#include "cc13x0_peripherals_setup.h"

#ifndef BOARD_I2C0_SCL
#warning "CC13X0 I2C Peripheral 0 is not linked to any pins"
#define BOARD_I2C0_SCL PIN_UNASSIGNED
#endif

#ifndef BOARD_I2C0_SDA
#define BOARD_I2C0_SDA PIN_UNASSIGNED
#endif

#ifndef BOARD_SPI0_SCLK
#warning "CC13X0 SPI Peripheral 0 is not linked to any pins"
#define BOARD_SPI0_SCLK PIN_UNASSIGNED
#endif

#ifndef BOARD_SPI0_MOSI
#define BOARD_SPI0_MOSI PIN_UNASSIGNED
#endif

#ifndef BOARD_SPI0_MISO
#define BOARD_SPI0_MISO PIN_UNASSIGNED
#endif

#ifndef BOARD_SPI0_CSN
#define BOARD_SPI0_CSN PIN_UNASSIGNED
#endif

#ifndef BOARD_SPI1_SCLK
#warning "CC13X0 SPI Peripheral 1 is not linked to any pins"
#define BOARD_SPI1_SCLK PIN_UNASSIGNED
#endif

#ifndef BOARD_SPI1_MOSI
#define BOARD_SPI1_MOSI PIN_UNASSIGNED
#endif

#ifndef BOARD_SPI1_MISO
#define BOARD_SPI1_MISO PIN_UNASSIGNED
#endif

#ifndef BOARD_SPI1_CSN
#define BOARD_SPI1_CSN PIN_UNASSIGNED
#endif

#ifndef BOARD_UART0_TX
#warning "CC13X0 UART Peripheral 0 is not linked to any pins"
#define BOARD_UART0_TX PIN_UNASSIGNED
#endif

#ifndef BOARD_UART0_RX
#define BOARD_UART0_RX PIN_UNASSIGNED
#endif

#ifndef BOARD_UART0_CTS
#define BOARD_UART0_CTS PIN_UNASSIGNED
#endif

#ifndef BOARD_UART0_RTS
#define BOARD_UART0_RTS PIN_UNASSIGNED
#endif

/*
 *  ========= default pin definitions from CC1310_LAUNCHXL ====================
 */


#define Board_DIO23_ANALOG          IOID_23
#define Board_DIO24_ANALOG          IOID_24
#define Board_DIO25_ANALOG          IOID_25
#define Board_DIO26_ANALOG          IOID_26
#define Board_DIO27_ANALOG          IOID_27
#define Board_DIO28_ANALOG          IOID_28
#define Board_DIO29_ANALOG          IOID_29
#define Board_DIO30_ANALOG          IOID_30

#define Board_GPTIMER0A             CC1310_LAUNCHXL_GPTIMER0A
#define Board_GPTIMER0B             CC1310_LAUNCHXL_GPTIMER0B
#define Board_GPTIMER1A             CC1310_LAUNCHXL_GPTIMER1A
#define Board_GPTIMER1B             CC1310_LAUNCHXL_GPTIMER1B
#define Board_GPTIMER2A             CC1310_LAUNCHXL_GPTIMER2A
#define Board_GPTIMER2B             CC1310_LAUNCHXL_GPTIMER2B
#define Board_GPTIMER3A             CC1310_LAUNCHXL_GPTIMER3A
#define Board_GPTIMER3B             CC1310_LAUNCHXL_GPTIMER3B

/*
 *  ============================= Pins begin ==================================
 */

#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(PINCC26XX_hwAttrs, ".const:PINCC26XX_hwAttrs")
#endif


const PINCC26XX_HWAttrs PINCC26XX_hwAttrs = {
    .intPriority = ~0,
    .swiPriority = 0
};

/*
 *  ============================= Power begin ==================================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(PowerCC26XX_config, ".const:PowerCC26XX_config")
#endif
const PowerCC26XX_Config PowerCC26XX_config = {
    .policyInitFxn      = NULL,
    .policyFxn          = &PowerCC26XX_standbyPolicy,
    .calibrateFxn       = &PowerCC26XX_calibrate,
    .enablePolicy       = true,
    .calibrateRCOSC_LF  = true,
    .calibrateRCOSC_HF  = true,
};
/*
 *  ============================= Power end ====================================
 */

/*
 *  ============================= UART begin ===================================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(UART_config, ".const:UART_config")
#pragma DATA_SECTION(uartCC26XXHWAttrs, ".const:uartCC26XXHWAttrs")
#endif

/* Include drivers */
#include <ti/drivers/UART.h>
#include <ti/drivers/uart/UARTCC26XX.h>

/* UART objects */
UARTCC26XX_Object uartCC26XXObjects[CC1310_LAUNCHXL_UARTCOUNT];
uint8_t uartCC26XXRingBuffer[CC1310_LAUNCHXL_UARTCOUNT][32];

/* UART hardware parameter structure, also used to assign UART pins */
const UARTCC26XX_HWAttrsV2 uartCC26XXHWAttrs[CC1310_LAUNCHXL_UARTCOUNT] = {
    {
        .baseAddr       = UART0_BASE,
        .powerMngrId    = PowerCC26XX_PERIPH_UART0,
        .intNum         = INT_UART0_COMB,
        .intPriority    = ~0,
        .swiPriority    = 0,
        .txPin          = BOARD_UART0_TX,
        .rxPin          = BOARD_UART0_RX,
        .ctsPin         = BOARD_UART0_CTS,
        .rtsPin         = BOARD_UART0_RTS,
        .ringBufPtr     = uartCC26XXRingBuffer[CC1310_LAUNCHXL_UART0],
        .ringBufSize    = sizeof(uartCC26XXRingBuffer[CC1310_LAUNCHXL_UART0])
    }
};

/* UART configuration structure */
const UART_Config UART_config[] = {
    {
        .fxnTablePtr = &UARTCC26XX_fxnTable,
        .object      = &uartCC26XXObjects[0],
        .hwAttrs     = &uartCC26XXHWAttrs[0]
    },
    {NULL, NULL, NULL}
};

const uint_least8_t UART_count = CC1310_LAUNCHXL_UARTCOUNT;

